<?php

use Illuminate\Database\Seeder;
use App\Models\Entities\Answer;

class AnswersTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        //Вопрос 1
        Answer::create([
            'question_id' => 1,
            'answer' =>'Термодинамикалық жүйелер үшін керек энергияның сақталу заңы',
            'points' => 1
        ]);
        Answer::create([
            'question_id' => 1,
            'answer' =>'Барлық инерциялық санақ жүйелері бір-бірінен айырмашылығы жоқ',
            'points' => 0
        ]);
        Answer::create([
            'question_id' => 1,
            'answer' =>'Жарықтың вакуумдағы жылдамдығы барлық инерциялдық санақ жүйесінде бірдей және тұрақты шама болады',
            'points' => 0
        ]);
        Answer::create([
            'question_id' => 1,
            'answer' =>'арнайы салыстырмалық бойынша координаталық өзгерістерді есептеу үшін пайдаланылатын трансформациялық теңдеулер',
            'points' => 0
        ]);

        //Вопрос 2
        Answer::create([
            'question_id' => 2,
            'answer' =>'Термодинамикалық жүйелер үшін керек энергияның сақталу заңы',
            'points' => 1
        ]);
        Answer::create([
            'question_id' => 2,
            'answer' =>'Барлық инерциялық санақ жүйелері бір-бірінен айырмашылығы жоқ',
            'points' => 0
        ]);
        Answer::create([
            'question_id' => 2,
            'answer' =>'Жарықтың вакуумдағы жылдамдығы барлық инерциялдық санақ жүйесінде бірдей және тұрақты шама болады',
            'points' => 0
        ]);
        Answer::create([
            'question_id' => 2,
            'answer' =>'арнайы салыстырмалық бойынша координаталық өзгерістерді есептеу үшін пайдаланылатын трансформациялық теңдеулер',
            'points' => 0
        ]);

        //Вопрос 3
        Answer::create([
            'question_id' => 3,
            'answer' =>'Термодинамикалық жүйелер үшін керек энергияның сақталу заңы',
            'points' => 1
        ]);
        Answer::create([
            'question_id' => 3,
            'answer' =>'Барлық инерциялық санақ жүйелері бір-бірінен айырмашылығы жоқ',
            'points' => 0
        ]);
        Answer::create([
            'question_id' => 3,
            'answer' =>'Жарықтың вакуумдағы жылдамдығы барлық инерциялдық санақ жүйесінде бірдей және тұрақты шама болады',
            'points' => 0
        ]);
        Answer::create([
            'question_id' => 3,
            'answer' =>'арнайы салыстырмалық бойынша координаталық өзгерістерді есептеу үшін пайдаланылатын трансформациялық теңдеулер',
            'points' => 0
        ]);

        //Вопрос 4
        Answer::create([
            'question_id' => 4,
            'answer' =>'Термодинамикалық жүйелер үшін керек энергияның сақталу заңы',
            'points' => 1
        ]);
        Answer::create([
            'question_id' => 4,
            'answer' =>'Барлық инерциялық санақ жүйелері бір-бірінен айырмашылығы жоқ',
            'points' => 0
        ]);
        Answer::create([
            'question_id' => 4,
            'answer' =>'Жарықтың вакуумдағы жылдамдығы барлық инерциялдық санақ жүйесінде бірдей және тұрақты шама болады',
            'points' => 0
        ]);
        Answer::create([
            'question_id' => 4,
            'answer' =>'арнайы салыстырмалық бойынша координаталық өзгерістерді есептеу үшін пайдаланылатын трансформациялық теңдеулер',
            'points' => 0
        ]);
    }
}
