<?php
/**
 * Created by PhpStorm.
 * User: air
 * Date: 12.07.2020
 * Time: 16:54
 */

return [
    'back' => 'Назад',
    'order' => 'Очередь',
    'yes' => 'Да',
    'no' => 'Нет',
    'add' => 'Добавить',
    'save' => 'Сохранить',
    'delete' => 'Удалить',
    'edit' => 'Изменить',
    'not.found' => 'Не найдено!',
    'has.relations' => 'Имеют связанные данные!',
    'actions' => 'Действия',
    'really.delete' => 'Вы точно хотите удалить?',
    'warning' => 'Предупреждение!',
    'cancel' => 'Отмена',
    'added' => 'Успешно добавлено!',
    'edited' => 'Успешно изменено!',
    'deleted' => 'Успешно удалено!',
    'problems' => 'Пожалуйста, будьте осторожны! Возникли ошибки!',
];